{"intents":
[
            {
             "tag":"greetings",
             "patterns": ["hello","hey","hi","good day","greetings","what's up?","how is it going"],
             "responses":["hello","hey!","what can i do for you?"]
            },
            {
             "tag":"goodbye",
             "patterns": ["cya","see you later","goodbye","have a good day","bye","cao","see ya"],
             "responses":["have a nice day","goodbye"]
            },
            {
                "tag": "jokes",
                "patterns": [
                    "Tell me a joke",
                    "Joke",
                    "Make me laugh"
                ],
                "responses": [
                    "A perfectionist walked into a bar...apparently, the bar wasn't set high enough",
                    "I ate a clock yesterday, it was very time-consuming",
                    "Never criticize someone until you've walked a mile in their shoes. That way, when you criticize them, they won't be able to hear you from that far away. Plus, you'll have their shoes.",
                    "The world tongue-twister champion just got arrested. I hear they're gonna give him a really tough sentence.",
                    "I own the world's worst thesaurus. Not only is it awful, it's awful.",
                    "What did the traffic light say to the car? \"Don't look now, I'm changing.\"",
                    "What do you call a snowman with a suntan? A puddle.",
                    "How does a penguin build a house? Igloos it together",
                    "I went to see the doctor about my short-term memory problems the first thing he did was make me pay in advance",
                    "As I get older and I remember all the people Ive lost along the way, I think to myself, maybe a career as a tour guide wasnt for me.",
                    "o what if I don't know what 'Armageddon' means? It's not the end of the world."]
            },
            {
             "tag":"age",
             "patterns": ["how old","how old are you?","what is your age","how old are you","age?"],
             "responses":["I get reborn after every compilation","my developers are averagely 20 years!"]
            },
            {
             "tag":"job",
             "patterns": ["what do you do","how can you help me","what is your job","tell me what you love to do","can you tell me what you can offer"],
             "responses":["I am a medical assistant!","I am trained to be a medical assistant","I love geting to work with patients and making doctors and nurses jobs easier.","I educate patients on medications, special diets, and other"]
            },
            {
             "tag":"name",
             "patterns": ["what is your name","what should i call you","what's your name?","who are you?","can you tell me your name"],
             "responses":["you can call me Enam!","i am Enam!","i am Enam your medical assistant"]
            },
            {
             "tag":"common cold symptoms",
             "patterns": ["Runny or stuffy nose",
             "Sore throat",
             "Cough",
             "Congestion",
             "Slight body aches or a mild headache",
             "Sneezing",
             "Low-grade fever",
             "Generally feeling unwell (malaise)"],
             "responses":["It seems that you are suffering from common cold"]
            },
            {
             "tag":"fever symptoms",
             "patterns":["Sweating",
             "Chills and shivering",
             "Headache",
             "Muscle aches",
             "Loss of appetite",
             "Irritability",
             "Dehydration",
             "General weakness"],
             "responses":["It seems that you are suffering from fever"]
            },
            {
             "tag":"Diabetes symptoms",
             "patterns":["increased hunger",
             "increased thirst",
             "weight loss",
             "frequent urination",
             "blurry vision",
             "extreme fatigue"],
             "responses":["It seems that you are suffering from Diabetes"]
            },
            {
             "tag":"Depression symptoms",
             "patterns":["Hopeless outlook",
             "Lost interest",
             "Increased fatigue",
             "sleep problem",
             "Anxiety",
             "change in weight",
             "Looking at death"],
             "responses":["It seem that you are suffering from depression"]
            },
            {
             "tag":"Asthma symptoms",
             "patterns":["coughing",
             "tightness in the chest",
             "shortness of breath",
             "difficulty talking",
             "panic",
             "fatigue"],
             "responses":["It seem that you are suffering from Asthma"]
            },
            {
             "tag":"common cold prevention",
             "patterns":["What can I do to avoid getting common cold?",
                            "tell me some prevention method for common cold",
                            "What should I do if i am suffering from common cold?",
                            "How can I avoid getting a cold?",
                            "Any Preventions for common cold"],
             "responses":["Preventions that you must follow: Wash your hands regularly, Avoid touching your face, Clean frequently used surfaces, Use hand sanitizers. SUGGESTED FOODS ARE: Garlic, Vitamin C containing fruits, Leafy greens, Broccoli, Oatmeal, Spices, Chicken Soup"]
            },
            {
             "tag":"common cold medicine",
             "patterns":["What medicines or drug can I buy to help me with my common cold?",
                               "what medicine can I take for common cold?",
                               "What drug is best for common cold?",
                               "what medication can I take for common cold?",
                               "Drug or medicine for common cold"],
             "responses":["medicines you can consume: Dextromethorphan, Decongestant, Diphenhydramine, Crocin Cold & Flu Max."]
            },
            {
                "tag":"common cold food",
                "patterns":["What can I eat to avoid getting common cold?",
                               "tell me some foods I can take for common cold",
                               "What should I eat or drink if i am suffering from common cold?",
                               "What food is best for person having common cold"],
                "responses":["SUGGESTED FOODS you may comsume are: Garlic, Vitamin C containing fruits, Leafy greens, Broccoli, Oatmeal, Spices, Chicken Soup"]
            },
            {
             "tag":"fever prevention",
             "patterns":["What can I do to avoid getting fever?",
                           "tell me some prevention method for fever",
                            "What should I do if i am suffering from fever?",
                            "How can I avoid getting a fever?",
                            "Any Preventions for common fever"],
             "responses":["prevention that you must follow: Wash your hands, Cover your mouth when you cough and your nose when you sneeze, Clean frequently used surfaces, Avoid sharing cups, glasses, and eating utensils with other people."]
            },
            {
                "tag":"fever medicine",
                "patterns":["What medicines or drug can I buy to help me with my fever?",
                                  "what medicine can I take for fever?",
                                  "What drug is best for fever?",
                                  "what medication can I take for fever?",
                                  "Drug or medicine for fever"],
                "responses":["medicines you can consume : acetaminophen ,ibuprofen,aspirin,Crocin Cold & Flu Max."]
               },
               {
                   "tag":"fever food",
                   "patterns":["What can I eat to avoid getting fever?",
                                  "tell me some foods I can take for fever",
                                  "What should I eat or drink if i am suffering from fever?",
                                  "What food is best for person having fever"],
                   "responses":["SUGGESTED FOODS you may comsume are: Garlic, Vitamin C containing fruits, Leafy greens, Broccoli, Oatmeal, Spices, Chicken Soup"]
               },
            {
             "tag":"#diabetes prevention",
             "patterns":["What medicines can I buy to help me with my diabetes?","tell me some prevention method from diabetes","What should I eat or drink if i am suffering from diabetes?","How can I keep from getting diabetes?"],
             "responses":[" "]
            },
            {
                "tag":"diabetes prevention",
                "patterns":["What can I do to avoid getting diabetes?",
                               "tell me some prevention method for diabetes",
                               "What should I do if i am suffering from diabetes?",
                               "How can I avoid getting a diabetes?",
                               "Any Preventions for diabetes"],
                "responses":["prevention that you must follow :Cut Sugar and Refined Carbs From Your Diet,Work Out Regularly,Drink Water as Your Primary Beverage,Lose Weight If You re Overweight or Obese,Quit Smoking, Follow a Very-Low-Carb Diet, Watch Portion Sizes"]
               },
               {
                "tag":"diabetes medicine",
                "patterns":["What medicines or drug can I buy to help me with my diabetes?",
                                  "what medicine can I take for diabetes?",
                                  "What drug is best for diabetes?",
                                  "what medication can I take for diabetes?",
                                  "Drug or medicine for diabetes"],
                "responses":["medicines you can consume : Insulin , Amylinomimetic drug, Dipeptidyl peptidase-4 (DPP-4) inhibitor"]
               },
               {
                   "tag":"diabetes food",
                   "patterns":["What can I eat to avoid getting diabetes?",
                                  "tell me some foods I can take for diabetes",
                                  "What should I eat or drink if i am suffering from diabetes?",
                                  "What food is best for person having diabetes"],
                   "responses":["SUGGESTED FOODS ARE: Leafy greens, Avocados, Eggs"]
               },
            {
             "tag":"depression prevention",
             "patterns":["What medicines can I buy to help me with my depression?","tell me some prevention method from depression","What should I eat or drink if i am suffering from depression?","How can I keep from getting depression?"],
             "responses":["prevention that you must follow :Exercise regularly,Cut back on social media time,Drink Water as Your Primary Beverage,Build strong relationships,Minimize your daily choices, Follow a Very-Low-Carb Diet,SUGGESTED FOODS ARE:Get Enough Vitamin D,Include Omega-3 Fatty Acids,Beans and legumes"]
            },
            {
                "tag":"depression prevention",
                "patterns":["What can I do to avoid getting depression?",
                               "tell me some prevention method for depression",
                               "What should I do if i am suffering from depression?",
                               "How can I avoid getting a depression?",
                               "Any Preventions for depression"],
                "responses":["prevention that you must follow :Cut Sugar and Refined Carbs From Your Diet,Work Out Regularly,Drink Water as Your Primary Beverage,Lose Weight If You re Overweight or Obese,Quit Smoking, Follow a Very-Low-Carb Diet, Watch Portion Sizes"]
               },
               {
                "tag":"depression medicine",
                "patterns":["What medicines or drug can I buy to help me with my depression?",
                                  "what medicine can I take for depression?",
                                  "What drug is best for depression?",
                                  "what medication can I take for depression?",
                                  "Drug or medicine for depression"],
                "responses":["medicines you can consume: brexpiprazole, quetiapine, olanzapine"]
               },
               {
                   "tag":"depression food",
                   "patterns":["What can I eat to avoid getting depression?",
                                  "tell me some foods I can take for depression",
                                  "What should I eat or drink if i am suffering from depression?",
                                  "What food is best for person having depression"],
                   "responses":["SUGGESTED FOODS ARE: Leafy greens, Avocados, Eggs"]
               },
            {
             "tag":"asthma prevention",
             "patterns":["What medicines can I buy to help me with my asthma?","tell me some prevention method from asthma","What should I eat or drink if i am suffering from asthma?","How can I keep from getting asthma?"],
             "responses":["medicines you can consume : epinephrine,anticholinergic,Proair HFA, prevention that you must follow : Identify Asthma Triggers, Stay Away From Allergens,Avoid Smoke of Any Type,SUGGESTED FOODS ARE:carrots,juice,eggs,broccoli,cantaloupe,milk"]
            },
            {
             "tag":"Consultation",
             "patterns": ["who should i contact for consultation?","is there any doctor available?","can you give me some suggestions for doctor consultations?","can you set up a meeting with a doctor for consultation?","is there any doctor available for consultation"],
             "responses":["You can contact various doctors here for any kind of consultation: 1. https://www.1mg.com/online-doctor-consultation, 2. https://www.tatahealth.com/online-doctor-consultation/general-physician, 3. https://www.doconline.com/, or you can pay a visit to your local area doctor or family doctor."]
            }
]}